Revit 2027 API
LinkElementId.LinkedElementId Property
 The id of the element in the link, or invalidElementId if no link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LinkedElementId { get; }
Public ReadOnly Property LinkedElementId As ElementId
	Get
public:
property ElementId^ LinkedElementId {
	ElementId^ get ();
}
member LinkedElementId : ElementId with get
Property Value
ElementId
See Also
Reference
LinkElementId Class
Autodesk.Revit.DB Namespace